{
  "starSign": {
    "Aries": { 
      "Aries": "The meeting of two strong, passionate spirits is always challenging. But once the two learn to stop competing so much, it can lead to a truly rewarding relationship filled with adventure and mutual respect.", 
      "Taurus": "A classic case of fire meeting earth - your spontaneous nature clashes with Taurus's need for stability. While you admire their reliability, they may find your impulsiveness unsettling. Finding middle ground requires patience from both sides.", 
      "Gemini": "This dynamic pairing brings endless energy and intellectual stimulation. You both love adventure and new experiences, though Aries may grow frustrated with Gemini's indecisiveness. Communication flows easily in this mentally charged match.", 
      "Cancer": "Your direct, fiery approach can overwhelm sensitive Cancer, while their emotional needs may feel suffocating to you. This relationship requires Aries to develop tenderness and Cancer to embrace spontaneity for it to work.", 
      "Leo": "Two fire signs create an explosive, passionate connection full of drama and excitement. You understand each other's need for attention and admiration, though ego clashes are inevitable. This is a power couple when egos are balanced.", 
      "Virgo": "Your bold impulsiveness meets Virgo's careful analysis - a challenging but potentially complementary match. Virgo can ground you, while you help them take risks. Success requires appreciating your different approaches to life.", 
      "Libra": "Aries provides the action while Libra brings the charm in this dynamic pairing. You admire Libra's social grace, and they're drawn to your confidence. The key is balancing Aries's assertiveness with Libra's need for harmony.", 
      "Scorpio": "Two intense personalities create a magnetic, transformative connection. Your straightforwardness meets Scorpio's depth, creating powerful chemistry. Trust is crucial as both signs can be possessive and strong-willed.", 
      "Saggitarius": "A match made in adventurous heaven! You both crave freedom, excitement, and new experiences. This partnership feels like an endless journey with your perfect travel companion who matches your energy and optimism.", 
      "Capricorn": "Ambitious Capricorn admires your drive, while you respect their discipline. However, your impulsive nature clashes with their careful planning. This match works when you combine Aries's initiative with Capricorn's strategy.", 
      "Aquarius": "You're both independent and forward-thinking, creating an intellectually stimulating partnership. Aquarius appreciates your courage while you admire their innovation. The challenge is balancing emotional needs with intellectual connection.", 
      "Pisces": "Your fiery directness meets Pisces's dreamy sensitivity - a challenging but potentially healing match. You can provide direction while Pisces offers emotional depth. Patience and understanding are essential for this pairing." 
    },
    "Taurus": { 
      "Aries": "Your steady nature provides grounding for impulsive Aries, while they bring excitement to your life. However, Aries's need for constant change may clash with your love for routine. Finding balance between adventure and stability is key.", 
      "Taurus": "Two Taurus together create a stable, luxurious partnership built on mutual understanding. You share values of security, comfort, and sensual pleasures. The challenge lies in avoiding stubbornness and embracing change when needed.", 
      "Gemini": "Your practical, steady approach meets Gemini's restless intellect in this challenging match. While you provide stability, they offer mental stimulation. Success requires Taurus to be more flexible and Gemini to appreciate consistency.", 
      "Cancer": "A deeply nurturing and harmonious connection. You both value security, home, and emotional intimacy. Taurus provides the stability Cancer craves, while Cancer offers the emotional depth you appreciate. A naturally compatible pairing.", 
      "Leo": "Your earthy practicality balances Leo's fiery drama in this luxurious partnership. You admire Leo's confidence while they appreciate your reliability. The challenge is balancing Taurus's caution with Leo's need for admiration.", 
      "Virgo": "An earthy, practical match built on shared values and mutual understanding. You both appreciate routine, reliability, and attention to detail. This partnership feels naturally comfortable and grows stronger over time.", 
      "Libra": "Venus-ruled signs create an aesthetically pleasing, harmonious connection. You share love for beauty, comfort, and partnership. Taurus provides stability while Libra brings social grace - a balanced, romantic match.", 
      "Scorpio": "An intense, transformative partnership with powerful physical chemistry. Your steadfast nature provides security for passionate Scorpio, while they bring depth to your life. Trust and loyalty make this connection unbreakable.", 
      "Saggitarius": "Your need for stability clashes with Sagittarius's wanderlust in this challenging match. While you offer grounding, they bring adventure. Success requires Taurus to embrace spontaneity and Sagittarius to appreciate home.", 
      "Capricorn": "An ambitious, power-couple pairing built on shared goals and values. You both understand the importance of hard work, security, and long-term planning. This practical partnership grows stronger with time and shared accomplishments.", 
      "Aquarius": "Your traditional values meet Aquarius's unconventional approach in this thought-provoking match. While you provide grounding, they offer innovation. Success requires open-mindedness and respect for different perspectives.", 
      "Pisces": "A gentle, romantic connection where Taurus provides the anchor for dreamy Pisces. Your practicality helps ground their imagination, while they bring spiritual depth to your life. A nurturing, compassionate partnership." 
    },
    "Gemini": { 
      "Aries": "An energetic, mentally stimulating partnership full of ideas and adventures. You both love trying new things and intellectual banter. Aries provides the action while Gemini brings the ideas - a dynamic, never-boring match.", 
      "Taurus": "Your restless intellect meets Taurus's steady practicality in this challenging but complementary match. While you provide mental stimulation, they offer emotional stability. Success requires patience and appreciation of differences.", 
      "Gemini": "Two Geminis create an intellectually vibrant, socially active partnership. You understand each other's need for mental stimulation and freedom. The challenge is maintaining emotional depth amidst constant social and intellectual activity.", 
      "Cancer": "Your logical approach meets Cancer's emotional depth in this challenging match. While you provide intellectual stimulation, they offer emotional security. Success requires Gemini to develop sensitivity and Cancer to embrace variety.", 
      "Leo": "A socially dynamic, creative partnership full of fun and intellectual exchange. Leo's dramatic flair complements your witty banter. You both love socializing and mental stimulation - a lively, entertaining match.", 
      "Virgo": "An intellectually compatible match where communication flows easily. You both enjoy analysis and learning, though Virgo's criticism may bother sensitive Gemini. This works when focused on shared intellectual pursuits.", 
      "Libra": "An air sign pairing full of intellectual chemistry, social grace, and mental connection. You understand each other's need for balance, beauty, and stimulating conversation. A naturally harmonious, mentally engaging partnership.", 
      "Scorpio": "Your light-hearted approach meets Scorpio's intensity in this challenging but transformative match. While you provide mental stimulation, they offer emotional depth. Trust and emotional honesty are crucial for success.", 
      "Saggitarius": "An adventurous, freedom-loving partnership full of ideas and exploration. You both crave mental stimulation, travel, and new experiences. This feels like an endless conversation with your ideal adventure companion.", 
      "Capricorn": "Your flexible thinking meets Capricorn's structured approach in this complementary match. While you provide innovation, they offer practical implementation. Success requires balancing Gemini's spontaneity with Capricorn's planning.", 
      "Aquarius": "A meeting of brilliant minds with endless intellectual chemistry. You both value freedom, innovation, and mental stimulation. This partnership feels like being with your intellectual equal who understands your need for space.", 
      "Pisces": "Your logical mind meets Pisces's intuitive nature in this creatively inspiring match. While you provide intellectual structure, they offer imaginative depth. A partnership that balances analysis with intuition." 
    },
    "Cancer": { 
      "Aries": "Your emotional sensitivity meets Aries's bold directness in this challenging match. While Aries brings excitement, they may overwhelm your delicate nature. Success requires Aries to develop tenderness and Cancer to embrace courage.", 
      "Taurus": "A deeply nurturing, harmonious connection built on mutual need for security and comfort. Taurus provides the stability you crave, while you offer emotional depth. This partnership feels like coming home to safety and understanding.", 
      "Gemini": "Your emotional depth meets Gemini's intellectual lightness in this challenging match. While Gemini provides mental stimulation, they may struggle with your emotional needs. Success requires balancing logic with feeling.", 
      "Cancer": "Two Cancers create an intensely emotional, deeply understanding partnership. You intuitively understand each other's needs and provide mutual nurturing. The challenge is avoiding becoming too insular and dependent.", 
      "Leo": "Your emotional sensitivity meets Leo's dramatic warmth in this complementary match. Leo provides the confidence you admire, while you offer the emotional support they need. A partnership of mutual admiration and care.", 
      "Virgo": "A practical, nurturing connection where both signs value service and care. Virgo's analytical nature helps ground your emotions, while you provide emotional depth. A stable, gradually deepening partnership.", 
      "Libra": "Your emotional needs meet Libra's harmonious nature in this aesthetically pleasing match. Libra creates beauty and balance, while you provide emotional depth. Success requires balancing emotional needs with social harmony.", 
      "Scorpio": "A deeply intense, emotionally transformative partnership with powerful intuition. You both understand emotional depth and need for security. This connection feels fated and creates unbreakable emotional bonds.", 
      "Saggitarius": "Your need for emotional security clashes with Sagittarius's love for freedom in this challenging match. While they bring adventure, you provide emotional grounding. Success requires balancing security with independence.", 
      "Capricorn": "A stable, ambitious partnership where emotional security meets practical achievement. Capricorn provides the structure you need, while you offer emotional support. A partnership that builds security over time.", 
      "Aquarius": "Your emotional nature meets Aquarius's detached intellect in this challenging match. While they provide innovation, you offer emotional depth. Success requires respecting different approaches to life and feelings.", 
      "Pisces": "A deeply intuitive, emotionally connected partnership where both understand sensitivity and compassion. You create a magical, nurturing world together. This connection feels spiritually fated and emotionally complete." 
    },
    "Leo": { 
      "Aries": "Two fire signs create a dynamic, passionate partnership full of energy and mutual admiration. You understand each other's need for attention and adventure. This power couple combination thrives on shared enthusiasm and respect.", 
      "Taurus": "Your dramatic flair meets Taurus's steady reliability in this complementary match. While you provide excitement and warmth, they offer stability and luxury. A partnership that balances drama with comfort.", 
      "Gemini": "A socially vibrant, intellectually stimulating partnership full of fun and creativity. Gemini's wit complements your dramatic nature, and you both love being the center of attention. A lively, entertaining match.", 
      "Cancer": "Your warm confidence meets Cancer's emotional depth in this nurturing partnership. You provide the security Cancer needs, while they offer loyal devotion. A relationship built on mutual care and admiration.", 
      "Leo": "Two Leos create a royal, dramatic partnership full of mutual admiration and shared spotlight. You understand each other's need for recognition and luxury. The challenge is sharing the throne and avoiding power struggles.", 
      "Virgo": "Your dramatic nature meets Virgo's practical analysis in this complementary match. While you provide confidence and warmth, they offer helpful organization. Success requires appreciating different strengths.", 
      "Libra": "A glamorous, harmonious partnership where both appreciate beauty, social grace, and romance. Libra's charm complements your confidence perfectly. This relationship feels like a beautiful, balanced work of art.", 
      "Scorpio": "Two powerful personalities create an intense, transformative connection. Your confidence meets Scorpio's depth, creating magnetic chemistry. This partnership requires mutual respect and careful handling of strong wills.", 
      "Saggitarius": "An adventurous, optimistic partnership full of fun and philosophical discussions. You both love life, adventure, and being center stage. This feels like an endless celebration with your ideal companion.", 
      "Capricorn": "A power couple pairing where ambition meets confidence. You admire Capricorn's discipline, while they respect your leadership. Together you can achieve great things with proper balance of drama and practicality.", 
      "Aquarius": "Your warm confidence meets Aquarius's innovative intellect in this dynamic match. While you provide leadership, they offer visionary ideas. A partnership that combines charisma with innovation.", 
      "Pisces": "Your dramatic warmth meets Pisces's dreamy compassion in this creatively inspiring match. You provide direction and confidence, while they offer spiritual depth and unconditional support." 
    },
    "Virgo": { 
      "Aries": "Your analytical approach meets Aries's impulsive nature in this challenging but complementary match. While you provide practical planning, they bring initiative and courage. Success requires patience with different styles.", 
      "Taurus": "An earthy, practical partnership built on shared values of reliability and attention to detail. You both appreciate routine, quality, and gradual growth. This stable connection deepens beautifully over time.", 
      "Gemini": "Your careful analysis meets Gemini's intellectual curiosity in this mentally stimulating match. While you provide practical thinking, they offer innovative ideas. A partnership that balances analysis with creativity.", 
      "Cancer": "A nurturing, practical connection where both value service, care, and emotional security. Your analytical nature helps ground Cancer's emotions, while they provide the emotional depth you secretly crave.", 
      "Leo": "Your practical approach meets Leo's dramatic confidence in this complementary match. While you provide organization and helpful analysis, they offer warmth and leadership. A balanced partnership of different strengths.", 
      "Virgo": "Two Virgos create an incredibly efficient, organized partnership built on mutual understanding. You share values of improvement, service, and attention to detail. The challenge is avoiding excessive criticism.", 
      "Libra": "Your analytical mind meets Libra's harmonious nature in this balanced partnership. While you provide practical thinking, they offer social grace and aesthetic sense. A relationship that improves through mutual refinement.", 
      "Scorpio": "An intense, analytical partnership where deep understanding meets practical application. Your careful analysis complements Scorpio's investigative nature. This connection builds trust through demonstrated reliability.", 
      "Saggitarius": "Your practical nature clashes with Sagittarius's love for adventure in this challenging match. While you provide grounding, they bring expansion. Success requires balancing analysis with philosophical thinking.", 
      "Capricorn": "An ambitious, practical partnership where hard work and reliability create solid foundations. You both understand the value of discipline, organization, and long-term planning. A power couple in achievement.", 
      "Aquarius": "Your practical analysis meets Aquarius's innovative thinking in this intellectually stimulating match. While you provide implementation, they offer visionary ideas. A partnership that turns ideas into reality.", 
      "Pisces": "Your logical approach meets Pisces's intuitive nature in this complementary match. While you provide practical structure, they offer creative inspiration. A partnership that balances reality with dreams." 
    },
    "Libra": { 
      "Aries": "A dynamic partnership where Libra's diplomacy balances Aries's directness. You provide the social grace while they bring the initiative. This complementary match creates balance through opposing strengths.", 
      "Taurus": "A Venus-ruled pairing that appreciates beauty, comfort, and harmony. You both value partnership, aesthetics, and sensual pleasures. This relationship feels naturally balanced and aesthetically pleasing.", 
      "Gemini": "An air sign match full of intellectual chemistry, social grace, and mental stimulation. You understand each other's need for balance, communication, and variety. A naturally harmonious partnership.", 
      "Cancer": "Your harmonious nature meets Cancer's emotional depth in this nurturing partnership. You create beauty and balance while they provide emotional security. A relationship that blends aesthetics with emotional care.", 
      "Leo": "A glamorous, socially dynamic partnership where both appreciate beauty, romance, and admiration. Leo's confidence complements your charm perfectly. This relationship feels like a beautiful, balanced work of art.", 
      "Virgo": "Your harmonious approach meets Virgo's analytical nature in this refined partnership. While you provide social grace, they offer practical improvement. A relationship that grows through mutual refinement.", 
      "Libra": "Two Libras create an exceptionally harmonious, aesthetically focused partnership. You understand each other's need for balance, beauty, and partnership. The challenge is making decisions and handling conflict.", 
      "Scorpio": "Your light harmony meets Scorpio's emotional intensity in this transformative match. While you provide balance, they offer depth. Success requires Libra to embrace intensity and Scorpio to appreciate beauty.", 
      "Saggitarius": "A socially adventurous partnership full of philosophical discussions and cultural exploration. You both love beauty, travel, and intellectual exchange. An optimistic, expanding connection.", 
      "Capricorn": "Your social grace meets Capricorn's ambitious nature in this power couple pairing. While you provide charm and connections, they offer discipline and structure. A partnership that achieves through balance.", 
      "Aquarius": "An intellectually stimulating, socially conscious partnership where both value justice and innovation. You understand each other's need for mental connection and social ideals. A meeting of like-minded spirits.", 
      "Pisces": "A romantic, artistically inspired partnership where beauty meets dreams. Your aesthetic sense complements Pisces's creative imagination. This connection feels spiritually harmonious and creatively fulfilling." 
    },
    "Scorpio": { 
      "Aries": "Two intense personalities create a powerful, transformative connection. Your depth meets Aries's courage, creating magnetic chemistry. This partnership requires careful handling of strong wills and passions.", 
      "Taurus": "An intensely sensual, loyal partnership built on deep trust and mutual commitment. Your emotional depth finds security in Taurus's steadfast nature. This connection feels fated and unbreakable.", 
      "Gemini": "Your emotional intensity meets Gemini's intellectual lightness in this challenging match. While you provide depth, they offer mental stimulation. Success requires building trust across different approaches.", 
      "Cancer": "A deeply intuitive, emotionally profound partnership where both understand intensity and need for security. You create a private world of deep understanding and unconditional loyalty.", 
      "Leo": "Two powerful personalities create a dramatic, passionate connection. Your depth meets Leo's confidence, creating magnetic attraction. This partnership requires mutual respect and careful balance of power.", 
      "Virgo": "An analytical, deeply committed partnership where practical care meets emotional intensity. Your investigative nature finds appreciation in Virgo's attention to detail. A connection built on demonstrated loyalty.", 
      "Libra": "Your emotional depth meets Libra's harmonious nature in this transformative match. While you provide intensity, they offer balance and beauty. Success requires embracing different emotional styles.", 
      "Scorpio": "Two Scorpios create an incredibly intense, deeply transformative partnership. You understand each other's need for depth, loyalty, and emotional truth. The challenge is avoiding power struggles.", 
      "Saggitarius": "Your emotional intensity clashes with Sagittarius's love for freedom in this challenging match. While you provide depth, they bring expansion. Success requires balancing intimacy with independence.", 
      "Capricorn": "A powerful, ambitious partnership where emotional depth meets practical achievement. You both understand loyalty, hard work, and long-term commitment. A connection that builds empires together.", 
      "Aquarius": "Your emotional depth meets Aquarius's detached intellect in this challenging but stimulating match. While you provide intensity, they offer innovation. Success requires respecting different truth-seeking styles.", 
      "Pisces": "A deeply spiritual, emotionally profound partnership where intuition meets intensity. You both understand emotional depth and spiritual connection. This feels like a soul-level, transformative union." 
    },
    "Saggitarius": { 
      "Aries": "An adventurous, optimistic partnership full of energy and shared enthusiasm for life. You both love freedom, adventure, and new experiences. This feels like meeting your ideal travel and adventure companion.", 
      "Taurus": "Your love for freedom clashes with Taurus's need for stability in this challenging match. While you bring adventure, they provide grounding. Success requires balancing wanderlust with home comfort.", 
      "Gemini": "A mentally adventurous partnership full of ideas, travel, and philosophical discussions. You both crave intellectual stimulation and freedom. This connection feels like an endless, fascinating journey.", 
      "Cancer": "Your independent nature meets Cancer's need for emotional security in this challenging match. While you bring expansion, they provide emotional grounding. Success requires balancing freedom with intimacy.", 
      "Leo": "A fiery, optimistic partnership full of adventure, drama, and shared enthusiasm. You both love life, travel, and being center stage. This relationship feels like an endless celebration of possibilities.", 
      "Virgo": "Your philosophical nature meets Virgo's practical analysis in this complementary match. While you provide big-picture thinking, they offer practical details. A partnership that balances vision with implementation.", 
      "Libra": "A socially adventurous partnership full of cultural exploration and philosophical discussions. You both love beauty, travel, and intellectual exchange. An optimistic, harmoniously expanding connection.", 
      "Scorpio": "Your love for freedom meets Scorpio's need for depth in this challenging match. While you bring expansion, they provide emotional intensity. Success requires balancing independence with intimacy.", 
      "Saggitarius": "Two Sagittarians create an incredibly adventurous, freedom-loving partnership. You understand each other's need for independence and philosophical exploration. The challenge is maintaining focus and depth.", 
      "Capricorn": "Your optimistic expansion meets Capricorn's ambitious planning in this complementary match. While you provide vision, they offer practical achievement. A partnership that builds dreams into reality.", 
      "Aquarius": "A meeting of free spirits who value independence, innovation, and philosophical exploration. You understand each other's need for mental and physical freedom. An intellectually stimulating partnership.", 
      "Pisces": "Your philosophical nature meets Pisces's spiritual depth in this expansive match. While you provide adventure, they offer spiritual insight. A partnership that explores both outer and inner worlds." 
    },
    "Capricorn": { 
      "Aries": "An ambitious partnership where discipline meets initiative. You admire Aries's courage while they respect your planning abilities. Together you can achieve great things with proper balance of action and strategy.", 
      "Taurus": "An earthy, ambitious partnership built on shared values of security, quality, and long-term planning. You both understand the importance of hard work and gradual achievement. A solid, reliable connection.", 
      "Gemini": "Your structured approach meets Gemini's flexible thinking in this complementary match. While you provide practical planning, they offer innovative ideas. A partnership that turns concepts into reality.", 
      "Cancer": "A stable, nurturing partnership where emotional security meets practical achievement. You provide the structure Cancer needs, while they offer emotional support. A connection that builds security over time.", 
      "Leo": "A power couple pairing where ambition meets confidence. You admire Leo's leadership while they respect your discipline. Together you can build empires with proper balance of drama and practicality.", 
      "Virgo": "An incredibly efficient, ambitious partnership built on mutual understanding of hard work and improvement. You share values of organization, service, and long-term planning. A power couple in achievement.", 
      "Libra": "Your ambitious nature meets Libra's social grace in this power couple pairing. While you provide discipline and structure, they offer charm and connections. A partnership that achieves through balanced strengths.", 
      "Scorpio": "A powerful, intense partnership where ambition meets emotional depth. You both understand loyalty, hard work, and long-term commitment. This connection can build lasting legacies together.", 
      "Saggitarius": "Your disciplined planning meets Sagittarius's philosophical expansion in this complementary match. While you provide practical foundation, they offer visionary thinking. A partnership that balances earth and fire.", 
      "Capricorn": "Two Capricorns create an incredibly ambitious, disciplined partnership focused on shared goals and achievements. You understand each other's drive and commitment to success. The challenge is remembering to enjoy life.", 
      "Aquarius": "Your traditional approach meets Aquarius's innovative thinking in this complementary match. While you provide practical implementation, they offer visionary ideas. A partnership that builds the future.", 
      "Pisces": "Your practical nature meets Pisces's dreamy compassion in this complementary match. While you provide structure and ambition, they offer creative inspiration and emotional support. A balanced partnership." 
    },
    "Aquarius": { 
      "Aries": "An innovative, forward-thinking partnership where courage meets vision. You admire Aries's initiative while they respect your innovative ideas. Together you can pioneer new paths and create change.", 
      "Taurus": "Your unconventional thinking meets Taurus's traditional values in this challenging match. While you provide innovation, they offer stability and quality. Success requires respecting different approaches to life.", 
      "Gemini": "A meeting of brilliant minds with endless intellectual chemistry and shared love for innovation. You both value freedom, mental stimulation, and progressive ideas. An intellectually equal partnership.", 
      "Cancer": "Your detached intellect meets Cancer's emotional depth in this challenging match. While you provide innovation, they offer emotional security. Success requires balancing logic with emotional understanding.", 
      "Leo": "Your innovative thinking meets Leo's confident leadership in this dynamic match. While you provide visionary ideas, they offer charisma and execution. A partnership that combines innovation with drama.", 
      "Virgo": "Your innovative approach meets Virgo's analytical nature in this intellectually stimulating match. While you provide big ideas, they offer practical improvement. A partnership that innovates systematically.", 
      "Libra": "An intellectually harmonious partnership where both value justice, beauty, and social progress. You understand each other's need for mental connection and idealistic vision. A meeting of like-minded spirits.", 
      "Scorpio": "Your detached innovation meets Scorpio's emotional intensity in this challenging but stimulating match. While you provide visionary thinking, they offer depth. Success requires respecting different truth-seeking styles.", 
      "Saggitarius": "A meeting of free spirits who value independence, philosophical exploration, and innovation. You understand each other's need for mental and physical freedom. An expansive, forward-thinking partnership.", 
      "Capricorn": "Your innovative vision meets Capricorn's practical ambition in this power couple pairing. While you provide future-thinking ideas, they offer disciplined implementation. A partnership that builds tomorrow.", 
      "Aquarius": "Two Aquarians create an incredibly innovative, forward-thinking partnership focused on ideas and social progress. You understand each other's need for independence and intellectual freedom. The challenge is emotional connection.", 
      "Pisces": "Your innovative intellect meets Pisces's spiritual intuition in this creatively inspiring match. While you provide visionary thinking, they offer compassionate insight. A partnership that dreams of better worlds." 
    },
    "Pisces": { 
      "Aries": "Your dreamy sensitivity meets Aries's bold directness in this challenging but complementary match. While you provide spiritual depth, they bring courage and action. A partnership that balances dreams with reality.", 
      "Taurus": "A gentle, sensual partnership where dreams meet stability. Your spiritual depth finds grounding in Taurus's practical nature, while they appreciate your compassion and creativity. A nurturing connection.", 
      "Gemini": "Your intuitive nature meets Gemini's intellectual curiosity in this creatively stimulating match. While you provide imaginative depth, they offer mental stimulation. A partnership of different intelligences.", 
      "Cancer": "A deeply intuitive, emotionally profound partnership where both understand sensitivity and compassion. You create a magical, nurturing world together. This connection feels spiritually fated and complete.", 
      "Leo": "Your dreamy compassion meets Leo's dramatic warmth in this creatively inspiring match. While you provide spiritual support, they offer confidence and direction. A partnership of different but complementary strengths.", 
      "Virgo": "Your intuitive dreams meet Virgo's practical analysis in this complementary match. While you provide creative inspiration, they offer practical implementation. A partnership that makes dreams real.", 
      "Libra": "A romantic, artistically inspired partnership where beauty meets dreams. Your creative imagination complements Libra's aesthetic sense perfectly. This connection feels spiritually harmonious.", 
      "Scorpio": "A deeply spiritual, emotionally intense partnership where intuition meets depth. You both understand emotional and spiritual connection at the deepest levels. This feels like a soul-level, transformative union.", 
      "Saggitarius": "Your spiritual depth meets Sagittarius's philosophical expansion in this adventurous match. While you provide intuitive insight, they offer worldly wisdom. A partnership exploring inner and outer worlds.", 
      "Capricorn": "Your dreamy nature meets Capricorn's practical ambition in this complementary match. While you provide creative inspiration, they offer structure and achievement. A partnership that balances dreams with reality.", 
      "Aquarius": "Your spiritual intuition meets Aquarius's innovative intellect in this creatively inspiring match. While you provide compassionate insight, they offer visionary ideas. A partnership dreaming of better worlds.", 
      "Pisces": "Two Pisces create an incredibly intuitive, spiritually connected partnership full of compassion and creativity. You understand each other's dreams and sensitivities perfectly. The challenge is staying grounded." 
    }
  },
  "mbti": {
    "INFP": { 
      "INFP": "Two INFPs create a deeply understanding, values-based connection where both appreciate authenticity and emotional depth. You share a rich inner world and creative spirit, though decision-making and practical matters may challenge you.", 
      "ENFP": "A magical pairing where INFP depth meets ENFP enthusiasm. Your shared values and intuition create endless creative possibilities, while ENFP's social energy helps bring your dreams into the world.", 
      "INFJ": "A soulmate-level connection where deep understanding meets shared values. You both appreciate depth, meaning, and authenticity, creating a relationship that feels spiritually fated and emotionally profound.", 
      "ENFJ": "A nurturing partnership where INFP authenticity meets ENFJ warmth. Your depth complements their social grace, creating a relationship that balances introspection with meaningful connection to others.", 
      "INTJ": "A complementary match where INFP idealism meets INTJ strategic vision. Your emotional depth balances their analytical nature, creating a partnership that can turn beautiful ideas into reality.", 
      "ENTJ": "A challenging but growth-oriented pairing where INFP sensitivity meets ENTJ determination. Your values can guide their ambition, while their efficiency helps manifest your creative visions.", 
      "INTP": "A intellectually and creatively stimulating partnership where INFP values meet INTP curiosity. You both appreciate deep thinking and authenticity, though emotional expression styles may differ.", 
      "ENTP": "An inspiring match where INFP depth meets ENTP innovation. Your shared intuition creates endless possibilities, while ENTP's energy helps bring your creative visions to life in unexpected ways.", 
      "ISFP": "A gentle, aesthetically focused partnership where both value authenticity and sensory beauty. You share a quiet understanding and appreciation for art, nature, and meaningful experiences.", 
      "ESFP": "A complementary pairing where INFP depth meets ESFP spontaneity. Your inner richness balances their love for experience, creating a relationship that enjoys both reflection and adventure.", 
      "ISTP": "A quietly complementary match where INFP idealism meets ISTP practicality. Your values can find expression through their hands-on approach, creating a partnership of different but harmonious strengths.", 
      "ESTP": "A challenging pairing where INFP sensitivity meets ESTP boldness. Your depth can ground their impulsiveness, while their action-orientation helps bring your values into the real world.", 
      "ISFJ": "A gentle, caring partnership where INFP dreams meet ISFJ practical support. Your creativity finds nurturing in their reliable care, creating a stable foundation for growth.", 
      "ESFJ": "A warm partnership where INFP authenticity meets ESFJ social warmth. Your depth complements their nurturing nature, though their need for social harmony may challenge your individuality.", 
      "ISTJ": "A complementary match where INFP creativity meets ISTJ reliability. Your visions can find practical expression through their systematic approach, creating stability for your dreams.", 
      "ESTJ": "A growth-oriented challenge where INFP values meet ESTJ efficiency. Your authenticity can humanize their systems, while their practicality helps ground your ideals in reality." 
    },
    "ENFP": { 
      "INFP": "An inspiring partnership where ENFP enthusiasm meets INFP depth. Your shared values and intuition create magical possibilities, while INFP's authenticity keeps your dreams meaningful and grounded.", 
      "ENFP": "Two ENFPs create an endlessly energetic, idea-filled partnership full of possibilities and enthusiasm. You understand each other's need for freedom and inspiration, though practical matters may need attention.", 
      "INFJ": "A deeply connected pairing where ENFP possibilities meet INFJ depth. Your enthusiasm inspires their vision, while their insight gives meaning to your ideas - a truly magical combination.", 
      "ENFJ": "A dynamic, socially engaged partnership where ENFP innovation meets ENFJ warmth. Your shared intuition and people-focus create meaningful change and deep connections with others.", 
      "INTJ": "A powerful pairing where ENFP possibilities meet INTJ strategy. Your enthusiasm for ideas finds practical direction in their planning, creating a partnership that can achieve visionary goals.", 
      "ENTJ": "An achievement-oriented match where ENFP creativity meets ENTJ determination. Your innovative ideas find powerful execution through their leadership, creating dynamic change together.", 
      "INTP": "An intellectually stimulating partnership where ENFP enthusiasm meets INTP curiosity. Your shared love for ideas and possibilities creates endless fascinating conversations and projects.", 
      "ENTP": "Two intuitive explorers creating an idea-filled, adventurous partnership. You understand each other's need for mental stimulation and freedom, making every day an exciting new possibility.", 
      "ISFP": "A creatively inspiring match where ENFP ideas meet ISFP aesthetic sensitivity. Your enthusiasm finds beautiful expression through their artistic nature, creating a partnership full of creative projects.", 
      "ESFP": "An energetic, experience-focused partnership where ENFP ideas meet ESFP spontaneity. You both love trying new things and sharing adventures, creating a lively, fun-filled relationship.", 
      "ISTP": "A complementary pairing where ENFP enthusiasm meets ISTP practicality. Your big ideas find hands-on expression through their technical skills, creating innovative projects together.", 
      "ESTP": "An adventurous match where ENFP possibilities meet ESTP bold action. Your creative ideas find immediate implementation through their daring, making life an exciting adventure.", 
      "ISFJ": "A warm partnership where ENFP enthusiasm meets ISFJ nurturing care. Your ideas and energy find stable support in their reliability, creating a balanced foundation for growth.", 
      "ESFJ": "A socially dynamic pairing where ENFP innovation meets ESFJ warmth. Your creative ideas find social expression through their people skills, creating meaningful community impact.", 
      "ISTJ": "A complementary challenge where ENFP ideas meet ISTJ reliability. Your creativity finds practical structure through their systematic approach, turning possibilities into reality.", 
      "ESTJ": "A growth-oriented pairing where ENFP innovation meets ESTJ efficiency. Your creative ideas find powerful implementation through their organizational skills, creating tangible results." 
    },
    "INFJ": { 
      "INFP": "A soulmate connection where INFJ vision meets INFP authenticity. Your shared depth and values create profound understanding, making this feel like a spiritually fated partnership of kindred spirits.", 
      "ENFP": "A magical pairing where INFJ depth meets ENFP enthusiasm. Your insight gives meaning to their ideas, while their energy helps bring your visions to life in the world.", 
      "INFJ": "Two INFJs create an intensely understanding, spiritually connected partnership. You share profound intuition and values, though you may need to remember practical matters in your deep conversations.", 
      "ENFJ": "A powerful partnership where INFJ insight meets ENFJ warmth. Your depth complements their social intuition, creating meaningful change and deep understanding in relationships.", 
      "INTJ": "A strategic pairing where INFJ intuition meets INTJ analysis. Your insight into people combines with their strategic thinking, creating a partnership that understands both hearts and systems.", 
      "ENTJ": "An impactful match where INFJ wisdom meets ENTJ leadership. Your understanding of human nature guides their ambition, creating leadership that's both effective and compassionate.", 
      "INTP": "An intellectually profound partnership where INFJ intuition meets INTP curiosity. Your shared love for deep thinking creates fascinating conversations about life's biggest questions.", 
      "ENTP": "A stimulating match where INFJ depth meets ENTP innovation. Your insight gives meaning to their ideas, while their energy helps communicate your visions in engaging ways.", 
      "ISFP": "A gentle, deeply felt partnership where INFJ intuition meets ISFP aesthetic sensitivity. Your understanding of people finds beautiful expression through their artistic nature.", 
      "ESFP": "A complementary pairing where INFJ depth meets ESFP spontaneity. Your insight helps guide their experiences, while their liveliness brings joy and practical expression to your visions.", 
      "ISTP": "A quietly complementary match where INFJ intuition meets ISTP practicality. Your understanding of people finds hands-on application through their technical problem-solving.", 
      "ESTP": "A challenging growth pairing where INFJ depth meets ESTP action. Your insight can ground their impulsiveness, while their boldness helps bring your visions into reality.", 
      "ISFJ": "A nurturing partnership where INFJ vision meets ISFJ practical care. Your deep understanding finds reliable support in their nurturing nature, creating stable foundations for growth.", 
      "ESFJ": "A warm, socially meaningful partnership where INFJ insight meets ESFJ nurturing. Your understanding of people combines with their social warmth to create deep community connections.", 
      "ISTJ": "A complementary match where INFJ intuition meets ISTJ reliability. Your insights find practical implementation through their systematic approach, creating lasting impact.", 
      "ESTJ": "A growth-oriented challenge where INFJ wisdom meets ESTJ efficiency. Your understanding of human nature can humanize their systems, while their organization helps manifest your visions." 
    },
    "ENFJ": { 
      "INFP": "A nurturing partnership where ENFJ warmth meets INFP authenticity. Your social intuition helps bring their creative depth into the world, while their genuineness keeps your connections meaningful.", 
      "ENFP": "A dynamic, socially engaged pairing where ENFJ warmth meets ENFP enthusiasm. Your shared people-focus and intuition create positive change and deep, meaningful relationships.", 
      "INFJ": "A profoundly connected partnership where ENFJ social intuition meets INFJ depth. Your warmth helps communicate their insights, while their understanding deepens your relationships.", 
      "ENFJ": "Two ENFJs create a warm, socially conscious partnership focused on meaningful connections and positive impact. You understand each other's need for harmony and growth, though may avoid necessary conflict.", 
      "INTJ": "A strategic partnership where ENFJ people skills meet INTJ vision. Your understanding of relationships combines with their strategic thinking to create well-planned positive change.", 
      "ENTJ": "A power couple pairing where ENFJ warmth meets ENTJ leadership. Your people skills humanize their ambition, creating leadership that's both effective and compassionate.", 
      "INTP": "A complementary match where ENFJ social intuition meets INTP curiosity. Your understanding of people helps ground their abstract thinking in human reality, creating balanced perspectives.", 
      "ENTP": "A dynamic partnership where ENFJ warmth meets ENTP innovation. Your people skills help communicate their creative ideas effectively, creating engaging social impact together.", 
      "ISFP": "A gentle, aesthetically focused partnership where ENFJ warmth meets ISFP sensitivity. Your social intuition helps showcase their artistic talents in meaningful ways.", 
      "ESFP": "A socially vibrant pairing where ENFJ warmth meets ESFP spontaneity. Your understanding of people combines with their love for experience to create joyful, meaningful connections.", 
      "ISTP": "A complementary pairing where ENFJ people skills meet ISTP practicality. Your understanding of relationships finds hands-on expression through their technical problem-solving.", 
      "ESTP": "An energetic match where ENFJ warmth meets ESTP boldness. Your social intuition can guide their actions toward positive impact, while their confidence helps implement your visions.", 
      "ISFJ": "A nurturing partnership where ENFJ vision meets ISFJ practical care. Your growth-focused approach finds reliable support in their nurturing nature, creating stable community impact.", 
      "ESFJ": "Two nurturing types creating a warm, socially active partnership focused on harmony and care. You understand each other's need for connection and stability, creating comforting relationships.", 
      "ISTJ": "A complementary match where ENFJ vision meets ISTJ reliability. Your people-focused goals find practical implementation through their systematic approach, creating lasting community structures.", 
      "ESTJ": "A community leadership pairing where ENFJ warmth meets ESTJ organization. Your understanding of people combines with their efficiency to create well-structured, caring communities." 
    },
    "INTJ": { 
      "INFP": "A complementary partnership where INTJ strategy meets INFP values. Your planning abilities can help manifest their creative visions, while their authenticity adds meaning to your goals.", 
      "ENFP": "A powerful pairing where INTJ vision meets ENFP possibilities. Your strategic thinking gives direction to their ideas, while their enthusiasm helps communicate your plans engagingly.", 
      "INFJ": "A deeply strategic partnership where INTJ analysis meets INFJ intuition. Your planning combines with their insight into people, creating well-understood, effectively implemented visions.", 
      "ENFJ": "An impactful match where INTJ strategy meets ENFJ warmth. Your systematic thinking finds human application through their people skills, creating plans that consider both efficiency and relationships.", 
      "INTJ": "Two INTJs create a highly strategic, vision-focused partnership built on mutual understanding of complex thinking. You appreciate each other's intelligence though may need more emotional connection.", 
      "ENTJ": "A power couple pairing where INTJ strategy meets ENTJ execution. Your detailed planning combines with their decisive leadership to create highly effective achievement of shared goals.", 
      "INTP": "An intellectually profound partnership where INTJ strategy meets INTP curiosity. Your shared love for complex thinking creates fascinating discussions about systems, ideas, and possibilities.", 
      "ENTP": "A stimulating match where INTJ planning meets ENTP innovation. Your strategic thinking can organize their creative ideas into actionable plans, creating well-structured innovation.", 
      "ISFP": "A quietly complementary pairing where INTJ vision meets ISFP aesthetic sensitivity. Your strategic goals find beautiful expression through their artistic talents and attention to detail.", 
      "ESFP": "A growth-oriented challenge where INTJ strategy meets ESFP spontaneity. Your planning can give direction to their experiences, while their liveliness brings joy to your systematic world.", 
      "ISTP": "A technically focused partnership where INTJ strategy meets ISTP practicality. Your big-picture planning finds hands-on implementation through their technical skills and problem-solving.", 
      "ESTP": "An action-oriented match where INTJ planning meets ESTP boldness. Your strategic vision finds immediate, confident implementation through their daring and practical approach.", 
      "ISFJ": "A complementary partnership where INTJ vision meets ISFJ reliability. Your strategic goals find practical, caring support in their nurturing and organized approach to life.", 
      "ESFJ": "A growth pairing where INTJ strategy meets ESFJ warmth. Your systematic thinking can benefit from their social intelligence, while your plans help structure their caring nature.", 
      "ISTJ": "An efficient partnership where INTJ vision meets ISTJ reliability. Your strategic planning finds meticulous implementation through their systematic approach, creating highly organized results.", 
      "ESTJ": "A power couple in achievement where INTJ strategy meets ESTJ efficiency. Your visionary planning combines with their organizational skills to create highly effective, well-structured success." 
    },
    "ENTJ": { 
      "INFP": "A growth-oriented pairing where ENTJ leadership meets INFP values. Your efficiency can help manifest their creative visions, while their authenticity adds meaning to your achievements.", 
      "ENFP": "A dynamic partnership where ENTJ execution meets ENFP ideas. Your decisive leadership gives powerful implementation to their creative possibilities, creating tangible results from inspiration.", 
      "INFJ": "An impactful match where ENTJ leadership meets INFJ wisdom. Your drive for achievement finds deeper meaning through their insight, creating leadership that's both effective and understanding.", 
      "ENFJ": "A power couple pairing where ENTJ determination meets ENFJ warmth. Your ambitious goals find compassionate expression through their people skills, creating caring leadership.", 
      "INTJ": "A strategic power couple where ENTJ execution meets INTJ planning. Your decisive action combines with their detailed strategy to create highly effective achievement of complex goals.", 
      "ENTJ": "Two ENTJs create an incredibly driven, achievement-focused partnership built on mutual ambition. You understand each other's need for efficiency and success, though may need more work-life balance.", 
      "INTP": "A complementary match where ENTJ action meets INTP innovation. Your leadership gives practical implementation to their theoretical ideas, turning abstract concepts into real-world solutions.", 
      "ENTP": "A dynamic partnership where ENTJ determination meets ENTP creativity. Your efficient execution gives powerful reality to their innovative ideas, creating groundbreaking results together.", 
      "ISFP": "A growth-oriented pairing where ENTJ leadership meets ISFP sensitivity. Your drive for achievement finds aesthetic expression through their artistic nature, creating meaningful accomplishments.", 
      "ESFP": "An energetic match where ENTJ efficiency meets ESFP spontaneity. Your organizational skills can structure their love for experience, while their liveliness brings joy to your achievements.", 
      "ISTP": "A technically efficient partnership where ENTJ leadership meets ISTP practicality. Your ambitious goals find hands-on, skilled implementation through their technical problem-solving.", 
      "ESTP": "An action-power couple where ENTJ strategy meets ESTP boldness. Your leadership combines with their confident action to create immediate, impressive results in any endeavor.", 
      "ISFJ": "A complementary partnership where ENTJ ambition meets ISFJ reliability. Your drive for achievement finds stable, caring support in their nurturing and organized approach.", 
      "ESFJ": "A community leadership pairing where ENTJ efficiency meets ESFJ warmth. Your ambitious goals find social expression through their people skills, creating well-organized, caring communities.", 
      "ISTJ": "An efficient power couple where ENTJ leadership meets ISTJ reliability. Your ambitious vision finds meticulous, systematic implementation through their organized approach to details.", 
      "ESTJ": "Two achievers creating a highly efficient, goal-oriented partnership focused on success and organization. You understand each other's drive for results and structured approach to life." 
    },
    "INTP": { 
      "INFP": "An intellectually and creatively stimulating partnership where INTP curiosity meets INFP values. Your shared love for deep thinking and authenticity creates fascinating explorations of ideas and meaning.", 
      "ENFP": "A idea-filled partnership where INTP analysis meets ENFP possibilities. Your logical thinking gives structure to their creative ideas, while their enthusiasm makes your explorations more engaging.", 
      "INFJ": "An intellectually profound match where INTP curiosity meets INFJ intuition. Your analytical thinking combines with their insight into patterns, creating deep understanding of complex systems.", 
      "ENFJ": "A complementary pairing where INTP analysis meets ENFJ warmth. Your logical thinking benefits from their understanding of people, creating more human-centered solutions and insights.", 
      "INTJ": "A strategic intellectual partnership where INTP curiosity meets INTJ planning. Your theoretical explorations find practical application in their strategic thinking, turning ideas into actionable plans.", 
      "ENTJ": "An efficient match where INTP innovation meets ENTJ execution. Your theoretical ideas find powerful implementation through their leadership, turning abstract concepts into real-world solutions.", 
      "INTP": "Two INTPs create an endlessly curious, intellectually stimulating partnership focused on ideas and systems. You understand each other's need for mental freedom and complex thinking.", 
      "ENTP": "A meeting of intellectual explorers creating fascinating discussions and innovative projects. You both love debating ideas and exploring possibilities, making every conversation an adventure.", 
      "ISFP": "A quietly complementary pairing where INTP analysis meets ISFP aesthetic sensitivity. Your theoretical thinking finds beautiful, practical expression through their artistic talents.", 
      "ESFP": "A growth-oriented challenge where INTP curiosity meets ESFP experience. Your analytical thinking can find real-world data through their adventures, while their spontaneity brings joy to your studies.", 
      "ISTP": "A technically focused partnership where INTP theory meets ISTP practicality. Your abstract thinking finds hands-on testing and application through their technical skills and problem-solving.", 
      "ESTP": "An action-oriented match where INTP analysis meets ESTP boldness. Your theoretical models find immediate real-world testing through their daring and practical approach to life.", 
      "ISFJ": "A complementary partnership where INTP curiosity meets ISFJ practical care. Your theoretical explorations find reliable, organized support in their nurturing approach to information.", 
      "ESFJ": "A growth pairing where INTP analysis meets ESFJ warmth. Your abstract thinking benefits from their social intelligence, while your ideas can help structure their caring nature.", 
      "ISTJ": "An efficient intellectual partnership where INTP innovation meets ISTJ reliability. Your theoretical ideas find systematic organization and practical application through their methodical approach.", 
      "ESTJ": "A complementary challenge where INTP curiosity meets ESTJ efficiency. Your theoretical explorations find practical implementation through their organizational skills, turning ideas into systems." 
    },
    "ENTP": { 
      "INFP": "An inspiring partnership where ENTP innovation meets INFP depth. Your creative ideas find meaningful direction through their values, while their authenticity keeps your explorations genuine.", 
      "ENFP": "Two intuitive explorers creating an idea-filled, energetic partnership full of possibilities. You understand each other's need for mental stimulation and freedom, making life an endless adventure.", 
      "INFJ": "A stimulating match where ENTP creativity meets INFJ insight. Your innovative ideas find deeper meaning through their intuition, while your energy helps communicate their visions engagingly.", 
      "ENFJ": "A dynamic partnership where ENTP innovation meets ENFJ warmth. Your creative ideas find compassionate expression through their people skills, creating meaningful social impact.", 
      "INTJ": "A strategic innovative pairing where ENTP possibilities meet INTJ planning. Your creative ideas find systematic implementation through their strategic thinking, turning innovation into reality.", 
      "ENTJ": "A powerful match where ENTP creativity meets ENTJ execution. Your innovative thinking finds decisive implementation through their leadership, creating groundbreaking results together.", 
      "INTP": "An intellectually thrilling partnership where ENTP energy meets INTP curiosity. Your shared love for ideas and debate creates endless fascinating explorations of possibilities and systems.", 
      "ENTP": "Two ENTPs create an incredibly energetic, idea-focused partnership full of innovation and debate. You understand each other's need for mental freedom and creative exploration.", 
      "ISFP": "A creatively inspiring match where ENTP ideas meet ISFP aesthetic sensitivity. Your innovative concepts find beautiful, sensory expression through their artistic talents and attention to detail.", 
      "ESFP": "An adventurous partnership where ENTP innovation meets ESFP spontaneity. Your creative ideas find immediate, experiential testing through their love for trying new things and adventures.", 
      "ISTP": "A technically innovative pairing where ENTP creativity meets ISTP practicality. Your theoretical ideas find hands-on prototyping and testing through their technical skills and problem-solving.", 
      "ESTP": "An action-packed match where ENTP ideas meet ESTP boldness. Your innovative concepts find immediate, confident implementation through their daring and practical approach to life.", 
      "ISFJ": "A growth-oriented pairing where ENTP innovation meets ISFJ reliability. Your creative ideas find stable, caring support in their nurturing and organized approach to life.", 
      "ESFJ": "A socially dynamic partnership where ENTP creativity meets ESFJ warmth. Your innovative ideas find compassionate social expression through their people skills and community focus.", 
      "ISTJ": "A complementary challenge where ENTP innovation meets ISTJ reliability. Your creative thinking finds systematic organization and practical application through their methodical approach.", 
      "ESTJ": "An efficient innovative pairing where ENTP ideas meet ESTJ organization. Your creative concepts find powerful implementation through their organizational skills, turning innovation into systems." 
    },
    "ISFP": { 
      "INFP": "A gentle, creatively focused partnership where both value authenticity and aesthetic sensitivity. You share a quiet understanding and appreciation for beauty, nature, and meaningful personal expression.", 
      "ENFP": "An inspiring match where ISFP aesthetic sensitivity meets ENFP enthusiasm. Your artistic talents find creative direction through their ideas, while your beauty brings sensory richness to their visions.", 
      "INFJ": "A deeply felt partnership where ISFP aesthetic sense meets INFJ intuition. Your artistic expression finds deeper meaning through their insight, while your beauty makes their visions tangible.", 
      "ENFJ": "A warm, aesthetically focused partnership where ISFP creativity meets ENFJ warmth. Your artistic talents find meaningful social expression through their people skills and encouragement.", 
      "INTJ": "A complementary pairing where ISFP aesthetic sensitivity meets INTJ strategy. Your artistic expression finds conceptual framework through their planning, creating well-structured beauty.", 
      "ENTJ": "A growth-oriented match where ISFP creativity meets ENTJ leadership. Your artistic talents find powerful promotion and implementation through their ambitious, organized approach.", 
      "INTP": "A quietly stimulating partnership where ISFP aesthetic sense meets INTP curiosity. Your artistic expression finds intellectual framework through their analytical thinking about beauty and form.", 
      "ENTP": "A creatively inspiring match where ISFP aesthetic sensitivity meets ENTP innovation. Your artistic talents find new directions and possibilities through their creative ideas and energy.", 
      "ISFP": "Two ISFPs create a gentle, aesthetically focused partnership built on shared sensitivity and appreciation for beauty. You understand each other's need for artistic expression and personal space.", 
      "ESFP": "A sensory-rich partnership where ISFP aesthetic sensitivity meets ESFP spontaneity. Your artistic nature finds joyful expression through their love for experience and social enjoyment.", 
      "ISTP": "A hands-on creative partnership where ISFP aesthetic sense meets ISTP practicality. Your artistic vision finds skilled technical execution through their problem-solving and craftsmanship.", 
      "ESTP": "An action-oriented match where ISFP creativity meets ESTP boldness. Your artistic talents find confident, immediate expression through their daring and love for experience.", 
      "ISFJ": "A gentle, caring partnership where ISFP aesthetic sensitivity meets ISFJ practical support. Your creative expression finds reliable, nurturing ground in their caring and organized approach.", 
      "ESFJ": "A warm, socially engaged partnership where ISFP creativity meets ESFJ warmth. Your artistic talents find appreciative social expression through their people skills and encouragement.", 
      "ISTJ": "A complementary match where ISFP aesthetic sense meets ISTJ reliability. Your creative expression finds stable, organized support in their systematic approach to life and details.", 
      "ESTJ": "A growth-oriented pairing where ISFP creativity meets ESTJ efficiency. Your artistic talents find organized promotion and practical implementation through their structured approach." 
    },
    "ESFP": { 
      "INFP": "A complementary pairing where ESFP spontaneity meets INFP depth. Your love for experience finds meaningful direction through their values, while your energy brings joyful expression to their creativity.", 
      "ENFP": "An energetic, experience-focused partnership where ESFP spontaneity meets ENFP enthusiasm. You both love trying new things, social adventures, and sharing joyful experiences together.", 
      "INFJ": "A growth-oriented match where ESFP spontaneity meets INFJ depth. Your love for experience finds meaningful context through their insight, while your liveliness brings joy to their visions.", 
      "ENFJ": "A socially vibrant partnership where ESFP spontaneity meets ENFJ warmth. Your love for experience finds meaningful social expression through their people skills and community focus.", 
      "INTJ": "A complementary challenge where ESFP experience meets INTJ strategy. Your practical awareness of current reality provides valuable data for their planning, while their vision gives direction to your adventures.", 
      "ENTJ": "An energetic match where ESFP spontaneity meets ENTJ leadership. Your love for experience finds organized expression through their ambitious goals, creating well-structured enjoyment.", 
      "INTP": "A growth pairing where ESFP experience meets INTP curiosity. Your practical awareness of real-world situations provides valuable data for their theoretical models, while their analysis gives depth to your experiences.", 
      "ENTP": "An adventurous partnership where ESFP spontaneity meets ENTP innovation. Your love for experience finds creative new directions through their ideas, making every adventure more fascinating.", 
      "ISFP": "A sensory-rich partnership where ESFP spontaneity meets ISFP aesthetic sensitivity. Your love for experience finds beautiful expression through their artistic nature and attention to sensory details.", 
      "ESFP": "Two ESFPs create an incredibly energetic, experience-focused partnership full of social joy and spontaneous adventures. You understand each other's need for fun and living in the moment.", 
      "ISTP": "An action-oriented partnership where ESFP spontaneity meets ISTP practicality. Your love for experience finds skilled, hands-on expression through their technical abilities and problem-solving.", 
      "ESTP": "An adventurous power couple where ESFP spontaneity meets ESTP boldness. You both love immediate experience and action, creating a relationship full of confident, exciting adventures.", 
      "ISFJ": "A warm partnership where ESFP spontaneity meets ISFJ reliability. Your love for experience finds stable, caring support in their nurturing nature and organized approach to life.", 
      "ESFJ": "A socially active partnership where ESFP spontaneity meets ESFJ warmth. Your love for experience finds harmonious social expression through their people skills and community focus.", 
      "ISTJ": "A complementary pairing where ESFP experience meets ISTJ reliability. Your awareness of current reality finds stable organization through their systematic approach to life and details.", 
      "ESTJ": "An efficient energetic match where ESFP spontaneity meets ESTJ organization. Your love for experience finds well-structured expression through their planning and efficient approach to enjoyment." 
    },
    "ISTP": { 
      "INFP": "A quietly complementary pairing where ISTP practicality meets INFP values. Your hands-on skills can help manifest their creative visions, while their authenticity adds meaning to your technical work.", 
      "ENFP": "An innovative partnership where ISTP practicality meets ENFP ideas. Your technical skills give hands-on reality to their creative possibilities, turning abstract concepts into functional creations.", 
      "INFJ": "A complementary match where ISTP problem-solving meets INFJ intuition. Your practical skills find deeper purpose through their insight, while your efficiency helps implement their visions.", 
      "ENFJ": "A growth-oriented pairing where ISTP practicality meets ENFJ warmth. Your technical abilities find meaningful social application through their people skills and community focus.", 
      "INTJ": "A strategic technical partnership where ISTP problem-solving meets INTJ planning. Your hands-on skills find conceptual framework through their strategic thinking, creating well-designed systems.", 
      "ENTJ": "An efficient match where ISTP practicality meets ENTJ leadership. Your technical abilities find ambitious implementation through their drive for achievement and organized approach.", 
      "INTP": "A technically focused partnership where ISTP hands-on skills meet INTP curiosity. Your practical problem-solving provides real-world data for their theoretical models, creating grounded innovation.", 
      "ENTP": "An innovative pairing where ISTP practicality meets ENTP creativity. Your technical skills give functional reality to their innovative ideas, prototyping and testing new concepts together.", 
      "ISFP": "A hands-on creative partnership where ISTP problem-solving meets ISFP aesthetic sensitivity. Your technical abilities find beautiful expression through their artistic vision and attention to detail.", 
      "ESFP": "An action-oriented match where ISTP practicality meets ESFP spontaneity. Your technical skills find immediate application through their love for experience and hands-on adventures.", 
      "ISTP": "Two ISTPs create a highly practical, skill-focused partnership built on mutual understanding of hands-on problem-solving. You appreciate each other's technical abilities and need for independence.", 
      "ESTP": "A technical action partnership where ISTP problem-solving meets ESTP boldness. Your skills find confident, immediate application through their daring and practical approach to challenges.", 
      "ISFJ": "A complementary partnership where ISTP practicality meets ISFJ reliability. Your technical skills find stable, organized support in their nurturing and systematic approach to life.", 
      "ESFJ": "A growth pairing where ISTP problem-solving meets ESFJ warmth. Your technical abilities find caring social application through their people skills and community focus.", 
      "ISTJ": "An efficient technical partnership where ISTP practicality meets ISTJ reliability. Your hands-on skills find meticulous organization through their systematic approach to details and procedures.", 
      "ESTJ": "A practical power couple where ISTP problem-solving meets ESTJ efficiency. Your technical abilities find highly organized implementation through their structured approach to projects and goals." 
    },
    "ESTP": { 
      "INFP": "A growth-oriented challenge where ESTP boldness meets INFP sensitivity. Your confident action can help bring their creative values into reality, while their authenticity adds depth to your experiences.", 
      "ENFP": "An adventurous partnership where ESTP boldness meets ENFP enthusiasm. Your confident action gives immediate reality to their creative ideas, turning possibilities into exciting experiences.", 
      "INFJ": "A challenging growth pairing where ESTP action meets INFJ depth. Your practical confidence can help implement their visions, while their insight gives meaning to your bold initiatives.", 
      "ENFJ": "An energetic match where ESTP boldness meets ENFJ warmth. Your confident action finds compassionate direction through their people skills, creating dynamic social impact together.", 
      "INTJ": "An action-strategy partnership where ESTP confidence meets INTJ planning. Your immediate practical action provides real-world testing for their strategic plans, creating well-grounded systems.", 
      "ENTJ": "A power couple in action where ESTP boldness meets ENTJ leadership. Your confident initiative finds organized implementation through their ambitious goals and efficient approach.", 
      "INTP": "A complementary challenge where ESTP action meets INTP analysis. Your practical confidence provides real-world data for their theoretical models, while their thinking gives framework to your experiences.", 
      "ENTP": "An adventurous innovative pairing where ESTP boldness meets ENTP creativity. Your confident action gives immediate reality to their innovative ideas, testing new concepts through experience.", 
      "ISFP": "An action-oriented match where ESTP confidence meets ISFP aesthetic sensitivity. Your bold initiatives find beautiful expression through their artistic nature and attention to sensory details.", 
      "ESFP": "An energetic power couple where ESTP boldness meets ESFP spontaneity. You both love immediate experience and confident action, creating a relationship full of exciting, joyful adventures.", 
      "ISTP": "A technical action partnership where ESTP confidence meets ISTP problem-solving. Your bold initiatives find skilled implementation through their technical abilities and practical solutions.", 
      "ESTP": "Two ESTPs create an incredibly energetic, action-focused partnership built on mutual confidence and love for experience. You understand each other's need for immediate action and practical results.", 
      "ISFJ": "A growth-oriented pairing where ESTP boldness meets ISFJ reliability. Your confident action finds stable, caring support in their nurturing nature and organized approach to life.", 
      "ESFJ": "A socially dynamic match where ESTP confidence meets ESFJ warmth. Your bold initiatives find harmonious social expression through their people skills and community focus.", 
      "ISTJ": "A complementary challenge where ESTP action meets ISTJ reliability. Your practical confidence finds stable organization through their systematic approach to life and careful planning.", 
      "ESTJ": "An efficient action partnership where ESTP boldness meets ESTJ organization. Your confident initiatives find highly structured implementation through their efficient approach to projects and goals." 
    },
    "ISFJ": { 
      "INFP": "A gentle, caring partnership where ISFJ practical support meets INFP authenticity. Your reliable care provides stable ground for their creative expression, while their depth enriches your nurturing.", 
      "ENFP": "A warm partnership where ISFJ reliability meets ENFP enthusiasm. Your stable support provides grounding for their ideas, while their energy brings joyful expansion to your caring nature.", 
      "INFJ": "A nurturing partnership where ISFJ practical care meets INFJ depth. Your reliable support provides stable foundation for their visions, while their insight gives deeper meaning to your nurturing.", 
      "ENFJ": "A warm, socially focused partnership where ISFJ practical care meets ENFJ warmth. Your reliable support combines with their people skills to create deeply caring, stable relationships.", 
      "INTJ": "A complementary match where ISFJ reliability meets INTJ strategy. Your practical care and attention to details provides stable implementation for their visions, creating well-supported plans.", 
      "ENTJ": "A growth-oriented pairing where ISFJ practical support meets ENTJ leadership. Your reliable care provides stable foundation for their ambitious goals, while their efficiency helps organize your nurturing.", 
      "INTP": "A complementary partnership where ISFJ practical care meets INTP curiosity. Your reliable support provides stable ground for their theoretical explorations, while their analysis gives framework to your information.", 
      "ENTP": "A growth pairing where ISFJ reliability meets ENTP innovation. Your stable support provides grounding for their creative ideas, while their energy brings new possibilities to your caring approach.", 
      "ISFP": "A gentle, aesthetically focused partnership where ISFJ practical care meets ISFP sensitivity. Your reliable support provides stable ground for their artistic expression, creating nurturing beauty.", 
      "ESFP": "A warm partnership where ISFJ reliability meets ESFP spontaneity. Your stable care provides grounding for their love of experience, while their energy brings joyful moments to your nurturing world.", 
      "ISTP": "A complementary pairing where ISFJ practical care meets ISTP problem-solving. Your reliable support provides stable foundation for their technical work, while their skills help implement your caring.", 
      "ESTP": "A growth-oriented match where ISFJ reliability meets ESTP boldness. Your stable care provides grounding for their confident actions, while their initiative helps bring your nurturing into action.", 
      "ISFJ": "Two ISFJs create an incredibly caring, reliable partnership built on mutual understanding of practical support and nurturing. You appreciate each other's need for stability and meaningful care.", 
      "ESFJ": "A warm, socially active partnership where ISFJ practical care meets ESFJ warmth. Your shared focus on nurturing and harmony creates deeply comforting, stable relationships and communities.", 
      "ISTJ": "An efficient caring partnership where ISFJ practical support meets ISTJ reliability. Your nurturing finds highly organized expression through their systematic approach to care and details.", 
      "ESTJ": "A community-focused pairing where ISFJ practical care meets ESTJ organization. Your nurturing finds efficient, structured expression through their planning and community leadership." 
    },
    "ESFJ": { 
      "INFP": "A warm partnership where ESFJ social warmth meets INFP authenticity. Your people skills help bring their creative depth into community, while their genuineness keeps your connections meaningful.", 
      "ENFP": "A socially dynamic partnership where ESFJ warmth meets ENFP enthusiasm. Your people skills provide social structure for their ideas, while their energy makes your community connections more vibrant.", 
      "INFJ": "A warm, deeply connected partnership where ESFJ social warmth meets INFJ insight. Your people skills help communicate their visions, while their depth gives greater meaning to your relationships.", 
      "ENFJ": "Two nurturing types creating a warm, socially active partnership focused on harmony and meaningful connections. You understand each other's need for caring relationships and community impact.", 
      "INTJ": "A growth-oriented pairing where ESFJ social warmth meets INTJ strategy. Your people skills provide valuable social intelligence for their plans, while their thinking helps structure your caring.", 
      "ENTJ": "A community leadership partnership where ESFJ warmth meets ENTJ efficiency. Your people skills humanize their ambitious goals, creating leadership that's both effective and compassionate.", 
      "INTP": "A complementary match where ESFJ social warmth meets INTP curiosity. Your people skills provide real-world social data for their theoretical models, while their analysis gives framework to your observations.", 
      "ENTP": "A socially dynamic partnership where ESFJ warmth meets ENTP innovation. Your people skills help ground their creative ideas in social reality, while their energy makes your connections more engaging.", 
      "ISFP": "A warm, aesthetically focused partnership where ESFJ social warmth meets ISFP sensitivity. Your people skills help showcase their artistic talents, while their beauty enriches your social world.", 
      "ESFP": "A socially vibrant partnership where ESFJ warmth meets ESFP spontaneity. Your people skills provide social harmony for their love of experience, while their energy makes your gatherings more joyful.", 
      "ISTP": "A growth pairing where ESFJ social warmth meets ISTP practicality. Your people skills provide social context for their technical work, while their problem-solving helps implement your caring practically.", 
      "ESTP": "A socially energetic match where ESFJ warmth meets ESTP boldness. Your people skills can guide their confident actions toward positive social impact, while their initiative helps activate your caring.", 
      "ISFJ": "A warm, community-focused partnership where ESFJ social warmth meets ISFJ practical care. Your shared focus on nurturing and harmony creates deeply stable, comforting relationships.", 
      "ESFJ": "Two ESFJs create an incredibly warm, socially active partnership built on mutual understanding of harmony and caring connections. You appreciate each other's need for meaningful relationships.", 
      "ISTJ": "An efficient community partnership where ESFJ social warmth meets ISTJ reliability. Your people skills find highly organized expression through their systematic approach to community care.", 
      "ESTJ": "A community leadership pairing where ESFJ warmth meets ESTJ organization. Your people skills combine with their efficiency to create well-structured, caring communities and social systems." 
    },
    "ISTJ": { 
      "INFP": "A complementary partnership where ISTJ reliability meets INFP authenticity. Your systematic approach provides stable structure for their creative values, while their depth adds meaning to your organized world.", 
      "ENFP": "A growth-oriented pairing where ISTJ reliability meets ENFP enthusiasm. Your organized approach provides stable framework for their ideas, while their energy brings creative possibilities to your systems.", 
      "INFJ": "A complementary match where ISTJ reliability meets INFJ insight. Your systematic approach provides stable implementation for their visions, while their depth gives greater meaning to your organized work.", 
      "ENFJ": "A community-focused partnership where ISTJ reliability meets ENFJ warmth. Your organized approach provides stable structure for their people-focused goals, while their warmth humanizes your systems.", 
      "INTJ": "An efficient strategic partnership where ISTJ reliability meets INTJ planning. Your systematic implementation provides stable reality for their strategic visions, creating well-grounded, organized results.", 
      "ENTJ": "A power couple in organization where ISTJ reliability meets ENTJ leadership. Your meticulous approach provides stable implementation for their ambitious goals, creating highly efficient, structured achievement.", 
      "INTP": "An efficient intellectual partnership where ISTJ reliability meets INTP curiosity. Your organized approach provides stable data management for their theoretical explorations, creating well-structured knowledge.", 
      "ENTP": "A growth-oriented pairing where ISTJ reliability meets ENTP innovation. Your systematic approach provides stable testing ground for their creative ideas, while their energy brings innovation to your systems.", 
      "ISFP": "A complementary partnership where ISTJ reliability meets ISFP aesthetic sensitivity. Your organized approach provides stable structure for their artistic expression, while their beauty enriches your systematic world.", 
      "ESFP": "A growth match where ISTJ reliability meets ESFP spontaneity. Your organized approach provides stable framework for their love of experience, while their energy brings joyful moments to your structured life.", 
      "ISTP": "An efficient technical partnership where ISTJ reliability meets ISTP practicality. Your systematic approach provides organized structure for their technical work, creating well-documented, reliable systems.", 
      "ESTP": "A complementary challenge where ISTJ reliability meets ESTP boldness. Your organized approach provides stable framework for their confident actions, while their initiative helps activate your systems.", 
      "ISFJ": "An efficient caring partnership where ISTJ reliability meets ISFJ practical care. Your systematic approach provides organized structure for their nurturing, creating stable, well-managed support systems.", 
      "ESFJ": "A community-focused partnership where ISTJ reliability meets ESFJ warmth. Your organized approach provides stable structure for their people skills, creating well-managed, caring communities.", 
      "ISTJ": "Two ISTJs create an incredibly reliable, organized partnership built on mutual understanding of systems and stability. You appreciate each other's need for order, planning, and careful attention to details.", 
      "ESTJ": "An efficient power couple where ISTJ reliability meets ESTJ organization. Your shared focus on systems and structure creates highly organized, predictable, and successful approaches to life and work." 
    },
    "ESTJ": { 
      "INFP": "A growth-oriented challenge where ESTJ efficiency meets INFP authenticity. Your organizational skills can help structure their creative values, while their genuineness adds human warmth to your systems.", 
      "ENFP": "A dynamic pairing where ESTJ organization meets ENFP enthusiasm. Your efficient approach provides practical structure for their ideas, while their energy makes your implementations more creative and engaging.", 
      "INFJ": "A growth-oriented match where ESTJ efficiency meets INFJ insight. Your organizational skills provide practical implementation for their visions, while their depth adds meaningful purpose to your systems.", 
      "ENFJ": "A community leadership partnership where ESTJ efficiency meets ENFJ warmth. Your organizational skills provide structured implementation for their people-focused goals, creating caring, well-managed communities.", 
      "INTJ": "A power couple in strategy where ESTJ efficiency meets INTJ planning. Your organizational implementation provides practical reality for their strategic visions, creating highly effective, well-structured systems.", 
      "ENTJ": "Two achievers creating a highly efficient, goal-oriented partnership focused on success and organization. You understand each other's drive for results, leadership, and structured approach to achievement.", 
      "INTP": "A complementary challenge where ESTJ efficiency meets INTP curiosity. Your organizational skills provide practical framework for their theoretical ideas, while their analysis improves your systems' design.", 
      "ENTP": "An efficient innovative pairing where ESTJ organization meets ENTP creativity. Your structured approach provides practical implementation for their innovative ideas, turning creativity into organized systems.", 
      "ISFP": "A growth-oriented pairing where ESTJ efficiency meets ISFP aesthetic sensitivity. Your organizational skills provide practical structure for their artistic talents, creating well-managed creative expression.", 
      "ESFP": "An energetic match where ESTJ organization meets ESFP spontaneity. Your efficient approach provides structured framework for their love of experience, while their energy makes your implementations more joyful.", 
      "ISTP": "A practical power couple where ESTJ efficiency meets ISTP problem-solving. Your organizational skills provide structured implementation for their technical work, creating highly efficient, reliable systems.", 
      "ESTP": "An action-oriented partnership where ESTJ organization meets ESTP boldness. Your efficient approach provides structured framework for their confident actions, creating well-managed, impressive results.", 
      "ISFJ": "A community-focused pairing where ESTJ efficiency meets ISFJ practical care. Your organizational skills provide structured implementation for their nurturing, creating efficient, caring support systems.", 
      "ESFJ": "A community leadership partnership where ESTJ efficiency meets ESFJ warmth. Your organizational skills combine with their people focus to create well-structured, caring communities and social systems.", 
      "ISTJ": "An efficient power couple where ESTJ organization meets ISTJ reliability. Your shared focus on systems, structure, and careful planning creates highly organized, predictable, and successful approaches to life.", 
      "ESTJ": "Two ESTJs create an incredibly efficient, goal-oriented partnership built on mutual understanding of organization and achievement. You appreciate each other's drive for results and structured leadership." 
    }
  },
  "zodiac": {
    "Rat": { 
      "Rat": "Two Rats understand each other's intelligence and ambition perfectly, creating a partnership of mutual respect and shared goals. However, you'll need to watch for competitive tendencies and learn to share the spotlight.", 
      "Ox": "A complementary match where Rat's cleverness meets Ox's reliability. Your quick thinking combines with their steady determination, creating a partnership that's both smart and stable in pursuing shared ambitions.", 
      "Tiger": "An exciting but challenging pairing where Rat's calculation meets Tiger's boldness. Your different approaches to life can create friction, but also bring balance if you learn from each other's strengths.", 
      "Rabbit": "A gentle pairing where Rat's ambition meets Rabbit's diplomacy. Your drive may overwhelm their sensitivity, but Rabbit's social grace can help Rat navigate relationships more smoothly.", 
      "Dragon": "A power couple combination where Rat's intelligence meets Dragon's charisma. You understand and admire each other's ambition and capabilities, creating a dynamic partnership that achieves great things together.", 
      "Snake": "A deeply understanding match where Rat's cleverness meets Snake's wisdom. Your mutual intelligence and strategic thinking create a partnership that's both mentally stimulating and practically successful.", 
      "Horse": "A challenging pairing where Rat's caution meets Horse's freedom-loving nature. Your different life approaches require compromise, but can bring exciting balance if you appreciate each other's qualities.", 
      "Goat": "A growth-oriented match where Rat's ambition meets Goat's creativity. Your practical drive can help manifest their artistic visions, while their sensitivity teaches you emotional depth.", 
      "Monkey": "An brilliant partnership where Rat's intelligence meets Monkey's ingenuity. You understand each other's cleverness perfectly, creating a dynamic, idea-filled relationship full of mutual admiration.", 
      "Rooster": "A complementary pairing where Rat's adaptability meets Rooster's precision. Your flexible thinking combines with their attention to detail, creating efficient problem-solving together.", 
      "Dog": "A loyal partnership where Rat's cleverness meets Dog's integrity. Your intelligence finds moral guidance in their loyalty, while your adaptability helps them see different perspectives.", 
      "Pig": "A comfortable match where Rat's ambition meets Pig's generosity. Your drive finds warm support in their giving nature, while your cleverness helps protect their sometimes-too-trusting heart." 
    },
    "Ox": { 
      "Rat": "A stable partnership where Ox's reliability meets Rat's intelligence. Your steady nature provides security for their clever mind, while their adaptability helps you navigate changing circumstances.", 
      "Ox": "Two Oxen create an incredibly reliable, determined partnership built on shared values of hard work and stability. You understand each other's need for routine and gradual, steady progress.", 
      "Tiger": "A challenging pairing where Ox's steadiness meets Tiger's boldness. Your different paces and approaches require patience, but can create balanced strength if you appreciate each other's qualities.", 
      "Rabbit": "A harmonious match where Ox's reliability meets Rabbit's diplomacy. Your steady nature provides security they appreciate, while their social grace helps you navigate relationships more smoothly.", 
      "Dragon": "A complementary partnership where Ox's determination meets Dragon's energy. Your steady work ethic grounds their big ideas, while their confidence inspires you to think bigger.", 
      "Snake": "A deeply understanding pairing where Ox's reliability meets Snake's wisdom. Your shared appreciation for careful planning and gradual achievement creates a stable, intelligent partnership.", 
      "Horse": "A growth-oriented challenge where Ox's steadiness meets Horse's freedom. Your different needs for stability versus adventure require compromise, but can bring exciting balance to each other's lives.", 
      "Goat": "A complementary match where Ox's practicality meets Goat's creativity. Your reliable nature provides stable foundation for their artistic expression, while their sensitivity softens your approach.", 
      "Monkey": "A challenging but stimulating pairing where Ox's methodical approach meets Monkey's cleverness. Your different thinking styles can create friction or complementary problem-solving.", 
      "Rooster": "An efficient partnership where Ox's diligence meets Rooster's precision. Your shared love for hard work and attention to detail creates highly productive, reliable results together.", 
      "Dog": "A loyal, stable partnership where Ox's determination meets Dog's integrity. Your shared values of loyalty and hard work create a deeply trustworthy, reliable connection.", 
      "Pig": "A comfortable, nurturing match where Ox's reliability meets Pig's generosity. Your steady nature provides the security they need, while their warmth makes your diligent world more joyful." 
    },
    "Tiger": { 
      "Rat": "An exciting challenge where Tiger's boldness meets Rat's calculation. Your different approaches to life can create dynamic balance or constant friction, depending on mutual respect and understanding.", 
      "Ox": "A growth-oriented pairing where Tiger's energy meets Ox's steadiness. Your bold initiatives find stable implementation through their reliable nature, while their patience teaches you consistency.", 
      "Tiger": "Two Tigers create an energetic, passionate partnership full of adventure and mutual understanding. You share a love for excitement and challenge, though may need to manage competitive tendencies.", 
      "Rabbit": "A complementary match where Tiger's courage meets Rabbit's diplomacy. Your boldness can benefit from their social grace, while your confidence helps them be more assertive when needed.", 
      "Dragon": "A powerful, dynamic partnership where Tiger's energy meets Dragon's charisma. You both understand and appreciate each other's strength and passion, creating an exciting, achievement-oriented relationship.", 
      "Snake": "A challenging pairing where Tiger's directness meets Snake's subtlety. Your different approaches to problems and relationships require understanding, but can create intriguing balance.", 
      "Horse": "An adventurous partnership where Tiger's courage meets Horse's freedom. You share a love for excitement, travel, and new experiences, making life together an endless adventure.", 
      "Goat": "A growth-oriented match where Tiger's strength meets Goat's creativity. Your confidence can support their artistic expression, while their sensitivity teaches you emotional depth.", 
      "Monkey": "An energetic pairing where Tiger's boldness meets Monkey's cleverness. Your different kinds of intelligence can create dynamic problem-solving or constant one-upmanship.", 
      "Rooster": "A challenging match where Tiger's spontaneity meets Rooster's precision. Your different approaches to life require compromise, but can create balanced effectiveness together.", 
      "Dog": "A loyal partnership where Tiger's courage meets Dog's integrity. Your bravery finds moral guidance in their loyalty, while your confidence helps them face challenges more boldly.", 
      "Pig": "A complementary pairing where Tiger's energy meets Pig's generosity. Your bold initiatives find warm support in their giving nature, while your strength helps protect their gentle heart." 
    },
    "Rabbit": { 
      "Rat": "A diplomatic pairing where Rabbit's grace meets Rat's intelligence. Your social skills complement their cleverness, creating a partnership that navigates both relationships and opportunities smoothly.", 
      "Ox": "A harmonious match where Rabbit's diplomacy meets Ox's reliability. Your social grace helps navigate the relationships that support their steady ambitions, creating comfortable stability.", 
      "Tiger": "A growth-oriented pairing where Rabbit's subtlety meets Tiger's boldness. Your diplomatic approach can temper their directness, while their confidence helps you be more assertive.", 
      "Rabbit": "Two Rabbits create a gentle, harmonious partnership built on mutual understanding of diplomacy and comfort. You appreciate each other's need for peace, beauty, and emotional security.", 
      "Dragon": "A complementary match where Rabbit's subtlety meets Dragon's energy. Your diplomatic skills can help channel their powerful energy positively, while their confidence inspires you.", 
      "Snake": "A deeply understanding pairing where Rabbit's grace meets Snake's wisdom. Your shared appreciation for subtlety and careful approach creates an elegant, intelligent partnership.", 
      "Horse": "A challenging but stimulating pairing where Rabbit's caution meets Horse's freedom. Your different needs for security versus adventure require balance and mutual appreciation.", 
      "Goat": "A beautifully harmonious match where Rabbit's diplomacy meets Goat's creativity. You both appreciate art, beauty, and gentle relationships, creating an aesthetically pleasing life together.", 
      "Monkey": "A socially dynamic pairing where Rabbit's grace meets Monkey's cleverness. Your diplomatic skills complement their intelligence, creating smooth social navigation together.", 
      "Rooster": "A complementary partnership where Rabbit's subtlety meets Rooster's precision. Your diplomatic approach balances their direct criticism, creating harmonious effectiveness.", 
      "Dog": "A loyal, comfortable partnership where Rabbit's diplomacy meets Dog's integrity. Your social grace combines with their loyalty to create trustworthy, harmonious relationships.", 
      "Pig": "A gentle, nurturing match where Rabbit's grace meets Pig's generosity. You both value harmony, comfort, and emotional security, creating a peacefully loving relationship." 
    },
    "Dragon": { 
      "Rat": "A power couple combination where Dragon's charisma meets Rat's intelligence. Your energy and ambition find clever direction through their strategic thinking, creating dynamic achievement together.", 
      "Ox": "A complementary partnership where Dragon's energy meets Ox's reliability. Your big ideas find steady implementation through their determination, while your confidence inspires them.", 
      "Tiger": "An energetic, powerful pairing where Dragon's charisma meets Tiger's courage. You both understand and appreciate each other's strength and passion, creating an exciting life together.", 
      "Rabbit": "A growth-oriented match where Dragon's energy meets Rabbit's diplomacy. Your powerful presence benefits from their social grace, while your confidence helps them be more assertive.", 
      "Dragon": "Two Dragons create an incredibly dynamic, ambitious partnership full of energy and mutual admiration. You understand each other's need for achievement and recognition, though may compete for the spotlight.", 
      "Snake": "A deeply powerful pairing where Dragon's energy meets Snake's wisdom. Your charisma finds strategic direction through their insight, creating well-planned, impressive achievements.", 
      "Horse": "An adventurous partnership where Dragon's ambition meets Horse's freedom. You share a love for excitement and achievement, making life together an ambitious, ever-moving adventure.", 
      "Goat": "A complementary match where Dragon's strength meets Goat's creativity. Your powerful energy can help manifest their artistic visions, while their sensitivity adds beauty to your achievements.", 
      "Monkey": "A brilliant partnership where Dragon's charisma meets Monkey's cleverness. Your energy and their intelligence create dynamic problem-solving and impressive innovations together.", 
      "Rooster": "An efficient pairing where Dragon's ambition meets Rooster's precision. Your big visions find detailed implementation through their organized approach, creating well-executed success.", 
      "Dog": "A loyal partnership where Dragon's energy meets Dog's integrity. Your ambition finds moral guidance in their loyalty, while your confidence helps them embrace bigger opportunities.", 
      "Pig": "A warm, generous match where Dragon's ambition meets Pig's generosity. Your powerful energy finds appreciative support in their giving nature, while your strength protects their gentle heart." 
    },
    "Snake": { 
      "Rat": "A strategically brilliant pairing where Snake's wisdom meets Rat's intelligence. Your shared cleverness and appreciation for careful planning create a deeply understanding, successful partnership.", 
      "Ox": "A stable, intelligent match where Snake's wisdom meets Ox's reliability. Your strategic thinking finds steady implementation through their determination, creating gradual, sure success.", 
      "Tiger": "A challenging pairing where Snake's subtlety meets Tiger's boldness. Your different approaches to life require understanding, but can create intriguing balance and mutual growth.", 
      "Rabbit": "A deeply harmonious pairing where Snake's wisdom meets Rabbit's diplomacy. Your shared appreciation for subtlety and careful approach creates an elegant, intelligent relationship.", 
      "Dragon": "A powerful combination where Snake's strategy meets Dragon's energy. Your wise planning gives direction to their powerful ambition, creating well-considered, impressive achievements.", 
      "Snake": "Two Snakes create an incredibly intuitive, wise partnership built on mutual understanding of depth and strategy. You appreciate each other's intelligence and need for private reflection.", 
      "Horse": "A growth-oriented challenge where Snake's depth meets Horse's freedom. Your different needs for intimacy versus independence require balance and appreciation of each other's qualities.", 
      "Goat": "A creatively intelligent match where Snake's wisdom meets Goat's creativity. Your strategic thinking can help structure their artistic visions, while their sensitivity adds emotional depth.", 
      "Monkey": "A brilliantly clever pairing where Snake's wisdom meets Monkey's ingenuity. Your different kinds of intelligence complement each other perfectly in problem-solving and innovation.", 
      "Rooster": "An efficient partnership where Snake's strategy meets Rooster's precision. Your wise planning finds detailed implementation through their organized approach, creating careful success.", 
      "Dog": "A loyal, deep pairing where Snake's wisdom meets Dog's integrity. Your strategic thinking finds moral guidance in their loyalty, while your insight helps them understand complex situations.", 
      "Pig": "A comfortable, generous match where Snake's wisdom meets Pig's warmth. Your depth finds appreciative understanding in their generous nature, while your insight protects their trusting heart." 
    },
    "Horse": { 
      "Rat": "A challenging pairing where Horse's freedom meets Rat's calculation. Your different approaches to life require compromise, but can create exciting balance if you appreciate each other's qualities.", 
      "Ox": "A growth-oriented match where Horse's energy meets Ox's steadiness. Your love for adventure finds stable foundation in their reliability, while your spontaneity brings excitement to their routine.", 
      "Tiger": "An adventurous partnership where Horse's freedom meets Tiger's courage. You share a love for excitement, travel, and new experiences, making life together an endless, energetic adventure.", 
      "Rabbit": "A complementary pairing where Horse's energy meets Rabbit's diplomacy. Your spontaneous nature benefits from their social grace, while your confidence helps them be more adventurous.", 
      "Dragon": "A dynamic partnership where Horse's freedom meets Dragon's ambition. Your shared love for excitement and achievement creates a life full of energetic pursuits and mutual admiration.", 
      "Snake": "A growth-oriented challenge where Horse's spontaneity meets Snake's depth. Your different needs for freedom versus intimacy require balance and appreciation of each other's qualities.", 
      "Horse": "Two Horses create an incredibly energetic, freedom-loving partnership built on mutual understanding of adventure and independence. You share a love for travel and new experiences.", 
      "Goat": "A creatively adventurous match where Horse's energy meets Goat's creativity. Your love for experience finds beautiful expression through their artistic nature, creating an aesthetically rich life.", 
      "Monkey": "An energetic, clever pairing where Horse's spontaneity meets Monkey's ingenuity. Your shared love for fun and mental stimulation creates a lively, idea-filled relationship.", 
      "Rooster": "A challenging but stimulating match where Horse's freedom meets Rooster's precision. Your different approaches to life require compromise, but can create balanced effectiveness.", 
      "Dog": "A loyal, adventurous partnership where Horse's energy meets Dog's integrity. Your love for freedom finds trustworthy companionship in their loyalty, creating reliable adventures together.", 
      "Pig": "A generous, energetic match where Horse's spontaneity meets Pig's warmth. Your adventurous spirit finds appreciative support in their generous nature, while your energy brings them joy." 
    },
    "Goat": { 
      "Rat": "A growth-oriented pairing where Goat's creativity meets Rat's ambition. Your artistic nature finds practical direction through their cleverness, while your sensitivity adds beauty to their achievements.", 
      "Ox": "A complementary match where Goat's creativity meets Ox's reliability. Your artistic expression finds stable support in their steady nature, while your sensitivity softens their approach.", 
      "Tiger": "A stimulating pairing where Goat's sensitivity meets Tiger's strength. Your creative nature finds confident expression through their courage, while your artistry adds beauty to their bold world.", 
      "Rabbit": "A beautifully harmonious match where Goat's creativity meets Rabbit's diplomacy. You both appreciate art, beauty, and gentle relationships, creating an aesthetically pleasing life together.", 
      "Dragon": "A powerful creative pairing where Goat's artistry meets Dragon's energy. Your creative visions find powerful manifestation through their ambition, while your sensitivity adds beauty to their achievements.", 
      "Snake": "An deeply artistic match where Goat's creativity meets Snake's wisdom. Your artistic expression finds deeper meaning through their insight, while your sensitivity adds emotional depth to their strategies.", 
      "Horse": "An adventurous creative partnership where Goat's artistry meets Horse's energy. Your creative nature finds exciting expression through their love for experience, making art from adventure.", 
      "Goat": "Two Goats create an incredibly creative, sensitive partnership built on mutual understanding of art and emotion. You appreciate each other's need for beauty, creativity, and emotional security.", 
      "Monkey": "A creatively clever pairing where Goat's artistry meets Monkey's ingenuity. Your creative visions find innovative expression through their intelligence, making art in unexpected ways.", 
      "Rooster": "A complementary match where Goat's creativity meets Rooster's precision. Your artistic nature finds organized expression through their attention to detail, creating refined beauty.", 
      "Dog": "A loyal, creative partnership where Goat's sensitivity meets Dog's integrity. Your artistic expression finds trustworthy support in their loyalty, while your creativity brings beauty to their practical world.", 
      "Pig": "A generously creative match where Goat's artistry meets Pig's warmth. Your creative nature finds appreciative support in their generous spirit, creating beautifully loving expressions together." 
    },
    "Monkey": { 
      "Rat": "A brilliantly clever pairing where Monkey's ingenuity meets Rat's intelligence. Your shared cleverness and love for mental challenges create a dynamic, idea-filled relationship full of mutual admiration.", 
      "Ox": "A growth-oriented pairing where Monkey's cleverness meets Ox's reliability. Your innovative ideas find steady implementation through their determination, while your intelligence brings new solutions to their methods.", 
      "Tiger": "An energetic partnership where Monkey's cleverness meets Tiger's courage. Your different kinds of intelligence create dynamic problem-solving and exciting adventures together.", 
      "Rabbit": "A socially dynamic pairing where Monkey's intelligence meets Rabbit's diplomacy. Your clever ideas find smooth social expression through their grace, creating clever social navigation.", 
      "Dragon": "A powerful innovative pairing where Monkey's ingenuity meets Dragon's energy. Your clever ideas find ambitious implementation through their charisma, creating impressive innovations together.", 
      "Snake": "A deeply intelligent match where Monkey's cleverness meets Snake's wisdom. Your different approaches to thinking complement each other perfectly in strategy and problem-solving.", 
      "Horse": "An adventurous clever pairing where Monkey's intelligence meets Horse's energy. Your shared love for mental and physical adventure creates a lively, idea-filled relationship.", 
      "Goat": "A creatively clever match where Monkey's ingenuity meets Goat's creativity. Your intelligent ideas find beautiful expression through their artistic nature, creating innovative art together.", 
      "Monkey": "Two Monkeys create an incredibly clever, energetic partnership built on mutual understanding of intelligence and innovation. You appreciate each other's need for mental stimulation and fun.", 
      "Rooster": "An efficient clever pairing where Monkey's ingenuity meets Rooster's precision. Your innovative ideas find detailed implementation through their organized approach, creating well-executed innovations.", 
      "Dog": "A loyal partnership where Monkey's cleverness meets Dog's integrity. Your intelligence finds moral guidance in their loyalty, while your problem-solving helps them navigate complex situations.", 
      "Pig": "A generous, clever match where Monkey's intelligence meets Pig's warmth. Your clever ideas find appreciative support in their generous nature, while your problem-solving protects their trusting heart." 
    },
    "Rooster": { 
      "Rat": "An efficient pairing where Rooster's precision meets Rat's intelligence. Your attention to detail complements their strategic thinking, creating highly effective problem-solving together.", 
      "Ox": "A productive partnership where Rooster's precision meets Ox's reliability. Your shared love for hard work and attention to detail creates highly efficient, dependable results.", 
      "Tiger": "A challenging match where Rooster's precision meets Tiger's spontaneity. Your different approaches to life require compromise, but can create balanced effectiveness if you appreciate each other's strengths.", 
      "Rabbit": "A complementary pairing where Rooster's directness meets Rabbit's diplomacy. Your precision benefits from their social grace, while your attention to detail helps refine their elegant approach.", 
      "Dragon": "An ambitious partnership where Rooster's precision meets Dragon's energy. Your attention to detail ensures their big ideas are well-executed, while their confidence inspires your efforts.", 
      "Snake": "A strategically precise pairing where Rooster's attention to detail meets Snake's wisdom. Your precision ensures their careful plans are perfectly executed, creating sure success.", 
      "Horse": "A growth-oriented challenge where Rooster's precision meets Horse's freedom. Your different needs for order versus spontaneity require balance and appreciation of each other's qualities.", 
      "Goat": "A complementary match where Rooster's precision meets Goat's creativity. Your attention to detail helps refine their artistic expressions, while their creativity adds beauty to your organized world.", 
      "Monkey": "An efficient clever pairing where Rooster's precision meets Monkey's ingenuity. Your attention to detail ensures their clever ideas are well-implemented, creating innovative solutions.", 
      "Rooster": "Two Roosters create an incredibly precise, efficient partnership built on mutual understanding of organization and high standards. You appreciate each other's attention to detail and hard work.", 
      "Dog": "A loyal, efficient partnership where Rooster's precision meets Dog's integrity. Your high standards find moral support in their loyalty, while your organization helps structure their protective nature.", 
      "Pig": "A generous match where Rooster's precision meets Pig's warmth. Your attention to detail finds appreciative support in their generous nature, while your organization helps structure their comfortable world." 
    },
    "Dog": { 
      "Rat": "A loyal partnership where Dog's integrity meets Rat's intelligence. Your loyalty provides moral guidance for their cleverness, while their adaptability helps you see different perspectives.", 
      "Ox": "A deeply reliable pairing where Dog's loyalty meets Ox's steadiness. Your shared values of hard work and integrity create a trustworthy, stable partnership built on mutual respect.", 
      "Tiger": "A courageous partnership where Dog's loyalty meets Tiger's strength. Your integrity provides moral foundation for their bold initiatives, while their confidence helps you face challenges.", 
      "Rabbit": "A harmonious pairing where Dog's loyalty meets Rabbit's diplomacy. Your trustworthy nature provides security they appreciate, while their social grace helps you navigate relationships smoothly.", 
      "Dragon": "A powerful partnership where Dog's integrity meets Dragon's ambition. Your loyalty provides moral compass for their powerful energy, while their confidence inspires your protective nature.", 
      "Snake": "A deeply loyal pairing where Dog's integrity meets Snake's wisdom. Your trustworthy nature finds strategic depth in their insight, creating well-considered, principled actions together.", 
      "Horse": "An adventurous partnership where Dog's loyalty meets Horse's freedom. Your trustworthy nature provides reliable companionship for their adventures, creating loyal explorations together.", 
      "Goat": "A protective creative pairing where Dog's loyalty meets Goat's sensitivity. Your protective nature provides security for their artistic expression, while their creativity softens your practical approach.", 
      "Monkey": "A loyal clever partnership where Dog's integrity meets Monkey's intelligence. Your trustworthy nature provides moral guidance for their cleverness, while their problem-solving helps you navigate complexity.", 
      "Rooster": "An efficient loyal pairing where Dog's integrity meets Rooster's precision. Your loyalty combines with their high standards to create principled, well-organized approaches to life.", 
      "Dog": "Two Dogs create an incredibly loyal, trustworthy partnership built on mutual understanding of integrity and protection. You appreciate each other's need for honesty and reliable companionship.", 
      "Pig": "A generously loyal match where Dog's integrity meets Pig's warmth. Your protective nature finds appreciative support in their generous spirit, creating a deeply caring, trustworthy relationship." 
    },
    "Pig": { 
      "Rat": "A generous pairing where Pig's warmth meets Rat's intelligence. Your trusting nature finds clever protection in their strategic thinking, while your generosity softens their calculated approach.", 
      "Ox": "A comfortable match where Pig's generosity meets Ox's reliability. Your warm nature finds stable security in their steady presence, while your generosity makes their diligent world more joyful.", 
      "Tiger": "A complementary pairing where Pig's generosity meets Tiger's strength. Your warm support provides comfort for their bold initiatives, while their confidence helps protect your trusting nature.", 
      "Rabbit": "A gentle, harmonious match where Pig's generosity meets Rabbit's diplomacy. You both value harmony, comfort, and emotional security, creating a peacefully loving relationship together.", 
      "Dragon": "A warm, ambitious pairing where Pig's generosity meets Dragon's energy. Your supportive nature provides appreciative foundation for their ambitions, while their strength protects your gentle heart.", 
      "Snake": "A deeply comfortable match where Pig's warmth meets Snake's wisdom. Your generous nature finds appreciative understanding in their insight, while your trustworthiness supports their strategic nature.", 
      "Horse": "An adventurous generous pairing where Pig's warmth meets Horse's energy. Your supportive nature provides comfortable home base for their adventures, while their excitement brings joy to your life.", 
      "Goat": "A creatively generous match where Pig's warmth meets Goat's sensitivity. You both appreciate art, comfort, and emotional expression, creating a beautifully nurturing relationship.", 
      "Monkey": "A clever generous pairing where Pig's trust meets Monkey's intelligence. Your generous nature finds clever protection in their problem-solving, while your warmth makes their intellectual world more human.", 
      "Rooster": "A complementary match where Pig's generosity meets Rooster's precision. Your warm support appreciates their attention to detail, while your easygoing nature softens their critical approach.", 
      "Dog": "A loyal generous partnership where Pig's warmth meets Dog's integrity. Your trusting nature finds reliable protection in their loyalty, while your generosity makes their protective world more comfortable.", 
      "Pig": "Two Pigs create an incredibly generous, comfortable partnership built on mutual understanding of warmth and enjoyment. You appreciate each other's need for harmony, comfort, and generous spirit." 
    }
  },
  "blood": {
    "A": { 
      "A": "Two Type A individuals create a harmonious, understanding partnership where both value stability and careful planning. You share similar approaches to life and relationships, creating comfortable predictability together.", 
      "B": "A challenging but stimulating pairing where Type A's careful nature meets Type B's spontaneity. Your different approaches require compromise but can create exciting balance if you appreciate each other's qualities.", 
      "AB": "A complex but fascinating match where Type A's stability meets AB's adaptability. Your reliable nature provides grounding for their multifaceted personality, while their flexibility helps you embrace change.", 
      "O": "A complementary pairing where Type A's careful planning meets Type O's confidence. Your attention to detail balances their bold initiatives, creating well-considered, successfully executed plans together." 
    },
    "B": { 
      "A": "A growth-oriented pairing where Type B's spontaneity meets Type A's careful nature. Your love for freedom finds stabilizing structure in their planning, while your flexibility helps them embrace unexpected opportunities.", 
      "B": "Two Type B individuals create an energetic, freedom-loving partnership where both value independence and new experiences. You understand each other's need for spontaneity and mental stimulation.", 
      "AB": "An intellectually stimulating match where Type B's creativity meets AB's complexity. Your innovative thinking finds fascinating expression through their adaptable nature, creating dynamic ideas together.", 
      "O": "A confident partnership where Type B's flexibility meets Type O's determination. Your adaptable nature complements their strong will, creating resilient problem-solving and shared adventures." 
    },
    "AB": { 
      "A": "A complementary pairing where AB's adaptability meets Type A's stability. Your complex nature finds reliable grounding in their careful approach, while your flexibility helps them navigate change more smoothly.", 
      "B": "A creatively stimulating match where AB's complexity meets Type B's innovation. Your multifaceted thinking finds exciting expression through their creative ideas, making every day intellectually engaging.", 
      "AB": "Two AB types create an incredibly complex, intellectually rich partnership full of deep conversations and adaptable approaches. You understand each other's multifaceted nature and need for mental stimulation.", 
      "O": "A dynamic pairing where AB's adaptability meets Type O's confidence. Your flexible thinking finds powerful implementation through their determined nature, creating well-adapted, successful initiatives." 
    },
    "O": { 
      "A": "A balanced partnership where Type O's confidence meets Type A's careful planning. Your bold initiatives benefit from their attention to detail, while your determination helps them take well-considered risks.", 
      "B": "An energetic match where Type O's determination meets Type B's flexibility. Your strong will finds creative expression through their innovative thinking, creating resilient, adaptable problem-solving.", 
      "AB": "A powerful pairing where Type O's confidence meets AB's adaptability. Your determined nature finds sophisticated expression through their complex thinking, creating well-considered, strong initiatives.", 
      "O": "Two Type O individuals create a confident, determined partnership where both value strength and direct action. You understand each other's need for achievement and straightforward communication." 
    }
  }
}